# Introduction

As the entertainment industry surges and major corporations dive into original video content, a new company is poised to enter the competitive world of movie-making. Recognizing the complexities of the film business, especially for newcomers, the company seeks to establish a strong foundation by understanding current box office trends and transforming these insights into a strategic roadmap for their new studio.

To ensure a successful start, the company has enlisted our help as Group 7 members to identify which types of films are currently performing well at the box office and translate these findings into actionable recommendations.

# Business Understanding

The Business objective is to identify which film genres will consistently bring in the most revenue for this new studio.  There are many elements that contribute to a film's success and our goal is to analyze these factors through Exploratory Data Analysis (EDA) and linear regression. This will allow us to uncover trends and connections that will guide the studio's production choices. 

Ultimately, we want to translate these insights into actionable recommendations that will help the studio create films that captivate audiences and turn a profit.

# Objectives

## Main Objectives

1.To determine which types of films are performing best at the box office.

2.To identify key factors that contribute to a film's success.

##    Specific Objectives

1.Investigate key variables such as production budgets, domestic and worldwide gross revenues, release years, and genres.

2.Develop predictive models to determine factors significantly impacting box office performance.

3.To investigate the relationship between production budget and box office revenue.

4.To examine the impact of release timing on a film's success.

5.To provide data-driven recommendations for film production and release strategies.

# Data Understanding

In this analysis, we will use a datasets from:

    1.Box Office 
    2.IMDB
    3.Rotten Tomatoes
    4. The Movie
    5. The Numbers

The data containsning information about various films, including their genres, budgets, box office revenues, and release dailic.
Understanding the structure and contents of our data will be the first step in uncovering the insights needed to guide our new movie studio's strategy.

### Importing the necesarry libraries

In [240]:
import pandas as pd
import sqlite3

In [241]:
TN_df= pd.read_csv("tn.movie_budgets.csv", index_col= 0)

# The Numbers Movie Budgets dataframe

### Initial Data Inspection

Getting a preview of the first 10 rows

In [242]:
TN_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

Getting basic information about the whole dataset

In [243]:
TN_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5782 entries, 1 to 82
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       5782 non-null   object
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   object
 3   domestic_gross     5782 non-null   object
 4   worldwide_gross    5782 non-null   object
dtypes: object(5)
memory usage: 271.0+ KB

In [244]:
TN_df.describe()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
count,5782,5782,5782,5782,5782
unique,2418,5698,509,5164,5356
top,"Dec 31, 2014",Halloween,"$20,000,000",$0,$0
freq,24,3,231,548,367

In [245]:
TN_df.shape

(5782, 5)

# Data wrangling

#### Handling missing values

In [246]:
# Checking for missing values
TN_df.isnull().sum()

release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

There are no missing values in this dataframe

#### Cleaning of the release date column.

In [247]:
# Getting a preview of the first 5 rows of the "release_date" column
TN_df["release_date"].head()

id
1    Dec 18, 2009
2    May 20, 2011
3     Jun 7, 2019
4     May 1, 2015
5    Dec 15, 2017
Name: release_date, dtype: object

For my analysis it would be more helpful to split this data into release month and release year.

In [248]:
# Converting the release_date column to datetime format
TN_df["release_date"] = pd.to_datetime(TN_df["release_date"])

# Creating new columns for "release_year" and "release_month" by splitting the "release_date" column
TN_df["release_year"]= TN_df["release_date"].dt.year
TN_df["release_month"]= TN_df["release_date"].dt.month

# Preview of the first 3 rows of the resulting  dataframe
TN_df.head(3)

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month
id,,,,,,,
1,2009-12-18,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,12
2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,5
3,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,6

Now that we have split the release date in year and months we no longer have use for the release date column, hence we will drop it from the dataframe.

In [249]:
# Dropping the "release_date" column
TN_df = TN_df.drop(columns ="release_date", axis=1)
TN_df.head(3)

,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month
id,,,,,,
1,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009,12
2,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011,5
3,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019,6

#### Cleaning the movie column

Checking to see if there are duplicates. All the values in the "movie" column should be unique.

In [250]:
# Getting info about the movie column
TN_df["movie"].describe()

count          5782
unique         5698
top       Halloween
freq              3
Name: movie, dtype: object

The number of unique values not being equal to the total count of values shows that there are some duplicates in the movie column. The difference between the total counts and the unique values shows that there are 84 duplicated values. Below we check for duplicates and drop rows where the movie column has duplicate values.

In [251]:
# Creating a dataframe that combines rows where the movie column has duplicate values in the TN_df dataframe.

duplicate_movies = TN_df[TN_df.duplicated(subset='movie')]

# Getting a preview of the duplicated rows

duplicate_movies

,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month
id,,,,,,
74,Godzilla,"$125,000,000","$136,314,294","$376,000,000",1998,5
9,Robin Hood,"$99,000,000","$30,824,628","$84,747,441",2018,11
85,Fantastic Four,"$87,500,000","$154,696,080","$333,132,750",2005,7
44,The Mummy,"$80,000,000","$155,385,488","$416,385,488",1999,5
8,Hercules,"$70,000,000","$99,112,101","$250,700,000",1997,6
...,...,...,...,...,...,...
69,Cat People,"$134,000","$4,000,000","$8,000,000",1942,11
77,Night of the Living Dead,"$114,000","$12,087,064","$30,087,064",1968,10
78,The Birth of a Nation,"$110,000","$10,000,000","$11,000,000",1915,2
100,The Last House on the Left,"$87,000","$3,100,000","$3,100,000",1972,8
19,The Signal,"$50,000","$251,150","$406,299",2008,2

In [252]:
# Dropping rows where the movie column has duplicated values.

TN_df = TN_df.drop_duplicates(subset = ['movie'])

# Check if the changes have been implemented the new number of rows should now be 5698

TN_df.shape

(5698, 6)

#### Cleaning the production_budget, domestic_gross and world_wide gross columns

These columns represent financial figures thus it is important that we work with them in integer or float format to allow us to carry out mathematical functions on them.

In [253]:
# Checking their datatypes
TN_df.dtypes

movie                object
production_budget    object
domestic_gross       object
worldwide_gross      object
release_year          int32
release_month         int32
dtype: object

Since the three columns have object data types, we will convert them into integer format.

In [254]:
# Removing the commas and dollar signs from the columns

TN_df['production_budget'] = TN_df['production_budget'].replace('[\$,]','', regex=True)
TN_df['worldwide_gross'] = TN_df['worldwide_gross'].replace('[\$,]','', regex=True)
TN_df['domestic_gross'] = TN_df['domestic_gross'].replace('[\$,]','', regex=True)

# Converting the columns into integers
TN_df['production_budget'] = TN_df['production_budget'].astype("int64")
TN_df['worldwide_gross'] = TN_df['worldwide_gross'].astype("int64")
TN_df['domestic_gross'] = TN_df['domestic_gross'].astype("int64")

# Previewing the results, looking at the first 3 rows
TN_df.head(3)

,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month
id,,,,,,
1,Avatar,425000000,760507625,2776345279,2009,12
2,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,5
3,Dark Phoenix,350000000,42762350,149762350,2019,6

The data showing that there were movies that did not generate any revenue at all could be a sign that data was entered incorrectly. Hence we shall drop all rows where the world_wide gross is 0.

In [255]:
# Retaining rows where the values in the world_wide gross is greater than zero
TN_df = TN_df[TN_df['worldwide_gross'] > 0]

# checking that the zero values have been dropped.
assert (TN_df['worldwide_gross'] == 0).sum() == 0

Creating a profit column to allow us to access the profitability of each movie.

In [256]:
# Creating a profit column by subtracting the  production_budget from the worldwide_gross
TN_df["profit"] = (TN_df['worldwide_gross'] - TN_df['production_budget'])

# preview of the resultant dataframe
TN_df.head()

,movie,production_budget,domestic_gross,worldwide_gross,release_year,release_month,profit
id,,,,,,,
1,Avatar,425000000,760507625,2776345279,2009,12,2351345279
2,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,5,635063875
3,Dark Phoenix,350000000,42762350,149762350,2019,6,-200237650
4,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,5,1072413963
5,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017,12,999721747